[
    {
        "name": "Développeur .NET",
        "company": "Altimet Ayonis",
        "start": "2020/10/01",
        "end": "2024/10/01",
        "icon": "assets/AltimetAyonis.png",
        "description": "Développement et support des logiciels ICM et GALAXY, des solutions industrielles de mesure dimensionnelle multi-capteurs en 2D/3D. Responsable de l’uniformisation graphique UI/UX des logiciels sous Windows Forms. Gestion des interactions avec la base de données SQL Server via Entity Framework. Veille technologique sur WPF et étude d'ASP.NET pour la création d'un visualiseur de données."
    },
    {
        "name": "Chef de projet logiciel",
        "company": "QISAB",
        "start": "2023/07/17",
        "end": "2023/10/07",
        "icon": "assets/qisab.png",
        "description": "À la suite du rachat de la société QISAB, Altimet a acquis les brevets du capteur CWS 640, capable de mesurer la rugosité d'une surface au nanomètre près en seulement 1 ms. Ce capteur représente l’avenir d’Altimet. Actuellement, il est exploitable via trois logiciels prototypes développés sous LabVIEW et MATLAB, intégrant des fonctions avancées telles que le positionnement par bras robotique. Altimet ne souhaite pas proposer ces fonctionnalités avancées, préférant les laisser à la charge des clients. Mon rôle a été de formaliser et documenter le fonctionnement logiciel du CWS, tout en développant un SDK pour son exploitation."
    },
    {
        "name": "Technicien réseaux structurants",
        "company": "Orange",
        "start": "2017/09/01",
        "end": "2019/08/01",
        "icon": "assets/orange.png",
        "description": "Orange s'engage activement dans la formation des jeunes. J’ai ainsi été embauché à Évreux en tant que technicien réseaux structurants pour tout le département de l’Eure. Mon embauche a coïncidé avec d’importants changements : la fin des offres RTC a été annoncée, nécessitant le démontage des équipements RTC afin de libérer de l’espace pour ceux dédiés à la fibre. Parallèlement, Orange a commencé à préparer ses infrastructures mobiles pour l’arrivée de la 5G. Enfin, face à la forte demande d’installations chez les clients, certaines petites missions, jugées moins prioritaires, ont dû être mises en attente."
    }
]